app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
    @email = Email.new
    @emails = Email.all

INSERT INTO "emails" ("address", "created_at", "updated_at") VALUES (?, ?, ?)  [["address", "oleg@sample.com"], ["created_at", "2017-11-03 12:11:00.104377"], ["updated_at", "2017-11-03 12:11:00.104377"]]
SELECT "emails".* FROM "emails"
---
  def create

    @email = Email.new(params.require(:email).permit(:address))

    if @email.save
      redirect_to emails_path, notice: 'Thanks for your email. Looking forward to sending spam to you!'
    else
      @emails = Email.all